#include <stdio.h> //ประกาศเรียกใช่้ไลบรารีมาตรฐาน

void swap(int *x, int *y){ //ประกาศฟังกืชันชื่อ swap เเละรับพารามิเตอร์เป็น pointer ของจำนวนเต็มสองตัวครือ *x เเละ *y
    int temp; //ตัวเเปรชั่วคราวเพื่อเก็บค่าชั่วคราว
    temp = *x; //เก็บค่าที่ pointer x ชี้อยู่ลงใน temp
    *x = *y;  //นำค่าที่ pointer y ชี้อยู่ไปใส่ที่ pointer x
    *y = temp; //นำค่าที่เก็บใน temp ไปใส่ที่ pointer y
}
int main(){ //ฟังก์ชันหลักของโปรแกรม
    int a = 5, b = 10; //ประกาศตัวแปร a เเละ b เเละกำหนดค่าเริ่มต้น
    printf("Before swap: a = %d, b = %d\n", a, b); //เเสดงค่าของ a เเละ b ก่อนเรียกฟังก์ชัน swap
    swap(&a, &b); //เรียกใช้ฟังก์ชัน swap โดยส่งที่อยู่ของ a,b เพื่อให้ฟังก์ชันสามารถเปลี่ยนค่าได้
    printf("After swap: a = %d, b = %d\n", a, b); //เเสดงค่าของ a เเละ b หลังจากเรียกฟังก์ชัน swap
    return 0; //จบการทำงานของโปรแกรม
}
