#include <stdio.h> //ประกาศเรียกใช่้ไลบรารีมาตรฐาน

int main() {  //ฟังก์ชันหลักของโปรแกรม
    int x = 10; //ประกาศตัวแปรจำนวนเต็มชื่อ x และกำหนดค่าเริ่มต้นเป็น 10
    int *ptr; //ประกาศตัวแปร pointer ชื่อ ptr ที่ชี้ไปยังตัวแปรจำนวนเต็มหรือ int
    ptr = &x; //กำหนดให้ ptr ชี้ไปยังที่อยู่ของตัวแปร x เพราะใช้เครื่องหมาย & เพื่อดึงที่อยู่ของตัวแปร
    printf("Before: x = %d\n", x); //แสดงค่าของ x ก่อนการเปลี่ยนแปลง (อยู่ที่ 10)
    *ptr = 20; //ทำการเปลี่ยนค่าของตัวเเปร x ที่ pointer ptr ชี้อยู่เป็น 20 โดยใช้เครื่องหมาย * เพื่อเข้าถึงค่าที่ pointer ชี้ไป
    printf("After: x = %d\n", x); //แสดงค่าของ x หลังการเปลี่ยนแปลง (ตอนนี้จะเป็น 20)
    return 0;  //จบการทำงานของโปรแกรม
}